InformationRegisters/ВидыРаботМедицинскихОсмотровРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВидыРаботМедицинскихОсмотровРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботМедицинскихОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВидыРаботМедицинскихОсмотровРабочегоМеста/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПрежнийНаборЗаписей();
	МедицинскиеОсмотры.ЗаполнитьОрганизацию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотры.ОбновитьПериодичностьОсмотровРабочихМестПоНаборуВредныхФакторовВидовРабот(ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПрежнийНаборЗаписей()
	
	Если Отбор["РабочееМесто"].Использование = Ложь Или Не ЗначениеЗаполнено(Отбор.РабочееМесто.Значение) Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочееМесто", Отбор.РабочееМесто.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеНабора.РабочееМесто КАК РабочееМесто,
		|	ДанныеНабора.ВидОсмотра КАК ВидОсмотра,
		|	ДанныеНабора.ВидРабот КАК ВидРабот
		|ИЗ
		|	РегистрСведений.ВидыРаботМедицинскихОсмотровРабочегоМеста КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.РабочееМесто = &РабочееМесто";
	
	ДополнительныеСвойства.Вставить("ПрежнийНабор", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
